sss/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    XMin
    {
        type fixedValue;
        value uniform 0.001;
    }
    XMax
    {
        type zeroGradient;
    }
    YMin
    {
        type zeroGradient;
    }
    YMax
    {
        type zeroGradient;
    }
    ZMin
    {
        type zeroGradient;
    }
    ZMax
    {
        type zeroGradient;
    }
    XMin0
    {
        type zeroGradient;
    }
    XMax0
    {
        type zeroGradient;
    }
    YMin0
    {
        type zeroGradient;
    }
    YMax0
    {
        type zeroGradient;
    }
    ZMin0
    {
        type zeroGradient;
    }
    ZMax0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
