sss/constant/MRFProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
MRF0
{
  cellZone mrfCellZone0;
  active yes;
  nonRotatingPatches ();
  origin (0.5 0.5 0.0);
  axis (0.0 0.0 0.5);
  omega constant 1.7453292519943295;//[rad/s]
}
