sss/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.1 -0.1 -0.1)
  (1.1 -0.1 -0.1)
  (1.1 1.1 -0.1)
  (-0.1 1.1 -0.1)
  (-0.1 -0.1 1.1)
  (1.1 -0.1 1.1)
  (1.1 1.1 1.1)
  (-0.1 1.1 1.1)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (22 22 22) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary ();
