sss/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  Cuboid.stl
  {
    type triSurfaceMesh;
    name Cuboid;
    regions
    {
      XMax
      {
        name XMax;
      }
      XMin
      {
        name XMin;
      }
      YMax
      {
        name YMax;
      }
      YMin
      {
        name YMin;
      }
      ZMax
      {
        name ZMax;
      }
      ZMin
      {
        name ZMin;
      }
    }
  }
  Cuboid0.stl
  {
    type triSurfaceMesh;
    name Cuboid0;
    regions
    {
      XMax0
      {
        name XMax0;
      }
      XMin0
      {
        name XMin0;
      }
      YMax0
      {
        name YMax0;
      }
      YMin0
      {
        name YMin0;
      }
      ZMax0
      {
        name ZMax0;
      }
      ZMin0
      {
        name ZMin0;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-1e-09 -1e-09 -1e-09);
    max (1.000000001 1.000000001 1.000000001);
  }
  mrfCylinder0
  {
    type searchableCylinder;
    // Error epsilon is added/subtracted for stability.
    point1 (0.5 0.5 -1e-09);
    point2 (0.5 0.5 0.500000001);
    radius 0.100000001;
  }
}
castellatedMeshControls
{
  features (
    {
      file "Cuboid.eMesh";
      level 1;
    }
    {
      file "Cuboid0.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    Cuboid
    {
      level (0 0);
      regions
      {
        XMax
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        XMin
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
        YMax
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        YMin
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMax
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMin
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    Cuboid0
    {
      level (0 0);
      regions
      {
        XMax0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        XMin0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        YMax0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        YMin0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMax0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
        ZMin0
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    mrfCylinder0
    {
      mode inside;
      level (0 0);
      cellZone mrfCellZone0;
      faceZone mrfFaceZone0;
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((1 1));
    }
  }
  locationInMesh (0.5 0.5 0.5);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
